# GetAllMeasurableSpecs Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
UnitUtils..::..GetAllMeasurableSpecs Method
UnitUtils Class See Also
---
Gets the identifiers of all available measurable specs.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public static IList<ForgeTypeId> GetAllMeasurableSpecs()
```

Visual Basic
---
```text
Public Shared Function GetAllMeasurableSpecs As IList(Of ForgeTypeId)
```

Visual C++
---
```text
public:
static IList<ForgeTypeId^>^ GetAllMeasurableSpecs()
```

# ### Return Value
The spec identifiers.
# See Also
UnitUtils Class
Autodesk.Revit.DB Namespace